# Brewfile - Modernized Setup for ibarsi

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-versions"

# CLI Tools (Core)
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "wget"
brew "vim"
brew "grep"
brew "openssh"
brew "ack"
brew "tree"
brew "gnupg"
brew "git"
brew "git-lfs"
brew "gh"
brew "commitizen"

# Modern CLI Enhancements
brew "chezmoi"          # Dotfile manager
brew "fzf"              # Fuzzy finder
brew "zoxide"           # Better 'cd'
brew "bat"              # Better 'cat'
brew "eza"              # Better 'ls'
brew "mise"             # Universal version manager
brew "starship"         # Fast, minimal shell prompt
brew "speedtest-cli"
brew "gh-dash"          # GitHub CLI dashboard extension

# Casks (Apps)
cask "iterm2"
cask "brave-browser"
cask "google-chrome"
cask "visual-studio-code"
cask "slack"
cask "spotify"
cask "postman"
cask "rectangle"        # Window manager
cask "signal"
cask "docker"
cask "raycast"          # Productivity launcher
cask "font-fira-code-nerd-font" # Nerd font for icons (eza/starship)
