# Brewfile - Modernized Setup for ibarsi

# Taps
# CLI Tools (Core)
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "wget"
brew "vim"
brew "grep"
brew "openssh"
brew "ack"
brew "tree"
brew "gnupg"
brew "git-lfs"
brew "gh"
brew "tmux"
brew "commitizen"
brew "pre-commit"       # Deterministic pre-commit checks
brew "gitleaks"         # Secret scanning for commits/PRs
brew "cloudflared"
brew "go"
brew "jq"
brew "oath-toolkit"
brew "openvpn"

# Modern CLI Enhancements
brew "fzf"              # Interactive fuzzy selector (pick from lists)
brew "fd"               # Fast file discovery (complements fzf; not a replacement)
brew "zoxide"           # Better 'cd'
brew "bat"              # Better 'cat'
brew "eza"              # Better 'ls'
brew "mise"             # Universal version manager
brew "starship"         # Fast, minimal shell prompt
brew "k9s"              # Kubernetes cluster TUI
brew "doggo"            # Modern DNS client (dig replacement for daily use)
brew "mtr"              # Traceroute + ping in one view
brew "iperf3"           # Throughput testing

# Casks (Apps)
cask "ghostty"           # GPU-accelerated terminal (replaces iTerm2)
cask "warp"              # AI-native terminal with managed Catppuccin theme
cask "codex"             # OpenAI Codex CLI
cask "1password-cli"
# Optional/newer casks (higher rename/churn risk over time)
cask "chatgpt-atlas"
cask "comet"
cask "discord"
cask "docker"
cask "grandperspective"
cask "lulu"
cask "obsidian"
cask "raindropio"
cask "tradingview"
cask "brave-browser"
cask "google-chrome"
cask "zed"
cask "slack"
cask "spotify"
cask "postman"
cask "rectangle"        # Window manager
cask "signal"
cask "wireshark"        # GUI packet analysis
cask "raycast"          # Productivity launcher
cask "claude-code"      # Claude Code CLI (Anthropic)
cask "font-fira-code-nerd-font" # Nerd font for icons (eza/starship)
